Repository: 15835229565/phmi
Catalog: PHmiResources/Loc/Res.*.resx
Languages: ru

source: Add
ru: Добавить

source: Address in device
ru: Адрес в устройстве

source: Cancel
ru: Отмена

source: Can read
ru: Разрешить чтение

# CantChangeSelectorMessage
source: Can't change selector when module has uncommited changes.
ru: Нельзя изменять селектор, если в модуле имеются несохранённые данные.

source: Close
ru: Закрыть

# ContinueQuestion
source: Continue?
ru: Продолжить?

source: Copy
ru: Копировать

source: Delete
ru: Удалить

# DeleteRowsQuestion
source: Delete selected rows?
ru: Удалить выбранные строки?

source: Description
ru: Описание

source: Digital tags
ru: Цифровые теги

source: Edit
ru: Изменить

source: Exit
ru: Выйти

source: Export
ru: Экспорт

# HasChangesMessage
source: Module has uncommited changes.
ru: В модуле имеются несохранённые данные.

source: Import
ru: Импорт

source: I/O device
ru: Устройство ввода-вывода

source: I/O devices
ru: Устройства ввода-вывода

source: Name
ru: Название

source: New project
ru: Новый проект

source: Numeric tags
ru: Аналоговые теги

source: Ok
ru: Ок

source: Open
ru: Открыть

source: Options
ru: Параметры

source: Paste
ru: Вставить

source: Project
ru: Проект

source: Reload
ru: Обновить

source: Save
ru: Сохранить

# SaveChangesQuestion
source: Save changes?
ru: Сохранить изменения?

source: Tags
ru: Теги

# ThereAreChangesMessage
source: There are uncommited changes.
ru: Имеются несохраненные данные.

source: Type
ru: Тип

# UniqueErrorMessage
source: Field "{0}" must be unique. Dublicate items are:
ru: Поле "{0}" должно быть уникальным. Повторяющиеся элементы:

source: Validation error
ru: Ошибка валидации

# ValidationErrorMessage
source: Required fields are not set or invalid data is entered
ru: Не заполнены обязательные поля или введены неверные данные

# ColumnsCountNotMatchMessage
source: Columns count does not match
ru: Количество столбцов не совпадает

# ItemWithIdNotFoundMessage
source: Item with specified id "{0}" was not found
ru: Строка с указанным id "{0}" не была найдена

# NotValidIdMessage
source: "{0}" is not valid id
ru: Формат id "{0}" не верен

source: Details
ru: Детали

source: Error
ru: Ошибка

source: No
ru: Нет

# NotPHmiDatabaseMessage
source: Database "{0}" is not PHmi project database
ru: База данных "{0}" не является базой данных проекта PHmi

source: Open project
ru: Открыть проект

source: Remember
ru: Запомнить

source: Yes
ru: Да

# DotNetNameMessage
source: Field "{0}" should be a valid .NET variable name
ru: Поле "{0}" должно быть корректным именем .NET

# RequiredErrorMessage
source: Field "{0}" is required
ru: Поле "{0}" не должно быть пустым

# EngUnit
source: Engineer unit
ru: Единица измерения

source: Format
ru: Формат

source: Tag type
ru: Тип тега

source: Database
ru: База данных

source: Password
ru: Пароль

source: Port
ru: Порт

source: Server
ru: Сервер

source: User name
ru: Имя пользователя

# InvalidDoubleMessage
source: Field "{0}" should contain a valid double value
ru: Поле "{0}" должно быть значением типа double

# RowInEditingMode
source: Row is in editing mode
ru: Строка находится в режиме редактирования

source: Alarm categories
ru: Категории аварий

source: Alarm tags
ru: Теги аварий

# InvalidTimeSpanMessage
source: Field "{0}" should contain a valid time span value. Example: "{1}"
ru: Поле "{0}" должно быть значением временного интервала. Пример: "{1}"

source: Time to store
ru: Время хранения

source: Add alarm category
ru: Добавить категорию аварий

source: Add alarm tag
ru: Добавить тег аварий

source: Add digital tag
ru: Добавить цифровой тег

source: Add I/O device
ru: Добавить устройство ввода-вывода

source: Add numeric tag
ru: Добавить аналоговый тег

source: Edit alarm category
ru: Изменить категорию аварий

source: Edit alarm tag
ru: Изменить тег аварий

source: Edit digital tag
ru: Изменить цифровой тег

source: Edit I/O device
ru: Изменить устройство ввода-вывода

source: Edit numeric tag
ru: Изменить аналоговый тег

# DigitalTagPresentMessage
source: Digital tag with the same field "{0}" is present for items:
ru: Цифровой тег с таким же полем "{0}" существует для строк:

# NumericTagPresentMessage
source: Numeric tag with the same field "{0}" is present for items:
ru: Аналоговый тег с таким же полем "{0}" существует для строк:

source: Alarms
ru: Аварии

source: Alarm category
ru: Категория аварий

source: Digital tag
ru: Цифровой тег

source: Location
ru: Расположение

source: Acknowledgeable
ru: Квитируемая

source: Privilege
ru: Привилегия

source: Add trend category
ru: Добавить категорию трендов

source: Add trend tag
ru: Добавить тег трендов

source: Edit trend category
ru: Изменить категорию трендов

source: Edit trend tag
ru: Изменить тег трендов

source: Trend categories
ru: Категории трендов

source: Trend category
ru: Категория трендов

source: Trends
ru: Тренды

source: Trend tag
ru: Тег трендов

source: Trend tags
ru: Теги трендов

source: Numeric tag
ru: Аналоговый тег

source: Trigger
ru: Триггер

source: Trigger I/O device
ru: Устройство ввода-вывода триггера

# PasteRowErrorMessage
source: Error occured when inserting row where "{0}"="{1}" and "{2}"="{3}": {4}
ru: Ошибка при вставке строки, где "{0}"="{1}" и "{2}"="{3}": {4}

source: System
ru: Система

source: Users
ru: Пользователи

source: Add user
ru: Добавить пользователя

# CanChange
source: Entry editable
ru: Запись изменяема

source: Edit user
ru: Изменить пользователя

source: Photo
ru: Фото

source: User enabled
ru: Запись активна

source: Settings
ru: Настройки

source: Stand by server
ru: Резервный сервер

# ServerNameMessage
source: Field "{0}" must be in format "Server:Port"
ru: Поле "{0}" должно быть в формате "Сервер:Порт"

source: About
ru: О программе

source: Help
ru: Помощь

# TablesStored
source: Tables
ru: Таблиц

source: Rows stored
ru: Строк

source: Unselect
ru: Снять выделение

# SelectedRowsStatus
source: Rows selected: {0:N0}
ru: Строк выбрано: {0:N0}

# TotalRowsStatus
source: Rows total: {0:N0}
ru: Строк всего: {0:N0}

source: Backup files
ru: Файлы бэкап

source: File
ru: Файл

# ImportCompleted
source: Import сompleted
ru: Импорт завершён

source: Export completed
ru: Экспорт завершен

# AddToolTip
source: Add (Ctrl+N)
ru: Добавить (Ctrl+N)

# CloseModuleToolTip
source: Close (Ctrl+Q)
ru: Закрыть (Ctrl+Q)

# CopyToolTip
source: Copy (Ctrl+C)
ru: Копировать (Ctrl+C)

# DeleteToolTip
source: Delete (Ctrl+D)
ru: Удалить (Ctrl+D)

# EditToolTip
source: Edit (Ctrl+E)
ru: Изменить (Ctrl+E)

# PasteToolTip
source: Paste (Ctrl+V)
ru: Вставить (Ctrl+V)

# ReloadToolTip
source: Reload (Ctrl+R)
ru: Обновить (Ctrl+R)

# SaveToolTip
source: Save (Ctrl+S)
ru: Сохранить (Ctrl+S)

# UnselectToolTip
source: Unselect (Ctrl+U)
ru: Снять выделение (Ctrl+U)

# TooManyTrendTagsInCategoryMessage
source: Too many trend tags in a category (max is {0})
ru: Слишком много тегов трендов в категории (максимум {0})

# ConnectionParameterErrorMessage
source: Field "{0}" cannot include symbol ";"
ru: Поле "{0}" не может содержать символ ";"

# LengthMessage
source: "{0}" length can't be more than {1}
ru: Длина поля "{0}" не должно быть больше {1}

source: User ID
ru: Пользователь

# AssemblyDoesNotContainInterfaceImplementantionMessage
source: Assembly "{0}" does not contain type "{1}"
ru: Сборка "{0}" не содержит реализацию интерфейса "{1}"

# FileNotAssemblyMessage
source: File "{0}" is not assembly
ru: Файл "{0}" не является сборкой

# FileNotFoundMessage
source: File "{0}" is not found
ru: Файл "{0}" не найден

# TypeDoesNotHaveConstructorMessage
source: Type "{0}" does not have a valid constructor
ru: Тип "{0}" не имеет подходящего конструктора

# IoDeviceWithName
source: I/O device "{0}"
ru: Устройство ввода-вывода "{0}"

# TypeNotSupportedMessage
source: Type "{0}" not supported
ru: Тип "{0}" не поддерживается

source: Start error
ru: Ошибка запуска

source: Stop error
ru: Ошибка останова

# IoDeviceStartedMessage
source: I/O device "{0}" started
ru: Устройство ввода-вывода "{0}" запущено

source: End time
ru: Окончание

source: Message
ru: Сообщение

source: Start time
ru: Начало

source: Time
ru: Время

# ProjectStartedMessage
source: Project "{0}" started
ru: Проект "{0}" запущен

# ProjectStartingMessage
source: Project "{0}" is starting
ru: Проект "{0}" запускается

# ProjectStoppedMessage
source: Project "{0}" stopped
ru: Проект "{0}" остановлен

# ProjectStoppingMessage
source: Project "{0}" is stopping
ru: Проект "{0}" останавливается

source: Show
ru: Показать

# IoDeviceStoppedMessage
source: I/O device "{0}" stopped
ru: Устройство ввода-вывода "{0}" остановлено

source: Service is started
ru: Сервис запущен

source: Service is stopped
ru: Сервис остановлен

source: Build complete
ru: Строительство закончено

source: Build client
ru: Построить клиент

source: Namespace
ru: Пространство имен

source: Build
ru: Построить

source: Path
ru: Путь

source: Code
ru: Код

source: Resources
ru: Ресурсы

# DotNetNameSpaceMessage
source: Field "{0}" should be a valid .NET namespace name
ru: Поле "{0}" должно быть корректным пространством имен .NET

# DatabaseCreatedMessage
source: Database "{0}" created
ru: Создана база данных "{0}"

source: Users service started
ru: Служба пользователей запущена

# AlarmsStartedMessage
source: Alarms "{0}" started
ru: Аварии "{0}" запущены

# AlarmsStoppedMessage
source: Alarms "{0}" stopped
ru: Аварии "{0}" остановлены

source: Add log
ru: Добавить лог

source: Edit log
ru: Изменить лог

source: Logs
ru: Логи

# LogStargedMessage
source: Log "{0}" started
ru: Лог "{0}" запущен

# LogStoppedMessage
source: Log "{0}" stopped
ru: Лог "{0}" остановлен

source: Run
ru: Запустить

source: Install service
ru: Установить службу

source: Press any key to continue
ru: Для продолжения нажмите любую клавишу

source: Uninstall service
ru: Удалить службу

source: Use custom connection string
ru: Использовать другую строку соединения

source: Use project connection string
ru: Использовать строку соединения проекта

source: Install
ru: Установить

source: Hide at start
ru: Скрывать при запуске

# TrendsStartedMessage
source: Trends "{0}" started
ru: Тренды "{0}" запущены

# TrendsStoppedMessage
source: Trends "{0}" stopped
ru: Тренды "{0}" остановлены

source: Period
ru: Период

source: Quick start guide
ru: Быстрый запуск

source: Licenses
ru: Лицензии
